Rlesjak/am263_tractionDemo/libraries/ucc5870/include/ucc5870_regs.h
//#############################################################################
//
// FILE:  ucc5870_regs.h
//
// TITLE: header file for ucc5870 Registers and bit field definitions
//
//#############################################################################
//
// Copyright (C) 2021-2022 Texas Instruments Incorporated - http://www.ti.com/
//
// ALL RIGHTS RESERVED
//
//#############################################################################

#ifndef UCC5870_REGS_H
#define UCC5870_REGS_H

//
// Register Addresses
//
//UCC5870 Register Addresses
//
#define  CFG1            0x00
#define  CFG2            0x01
#define  CFG3            0x02
#define  CFG4            0x03
#define  CFG5            0x04
#define  CFG6            0x05
#define  CFG7            0x06
#define  CFG8            0x07
#define  CFG9            0x08
#define  CFG10           0x09
#define  CFG11           0x0a
#define  ADCDATA1        0x0b
#define  ADCDATA2        0x0c
#define  ADCDATA3        0x0d
#define  ADCDATA4        0x0e
#define  ADCDATA5        0x0f
#define  ADCDATA6        0x10
#define  ADCDATA7        0x11
#define  ADCDATA8        0x12
#define  CRCDATA         0x13
#define  SPITEST         0x14
#define  GD_ADDR         0x15
#define  STATUS1         0x16
#define  STATUS2         0x17
#define  STATUS3         0x18
#define  STATUS4         0x19
#define  STATUS5         0x1a
#define  CONTROL1        0x1b
#define  CONTROL2        0x1c
#define  ADCCFG          0x1d
#define  DOUTCFG         0x1e

//
// REGISTER BIT FIELD DEFINITIONS
//
// UCC5870 CFG1 Register bit definitions:
//
struct  UCC5870_CFG1_REG_BITS
{                                 // bit    description
    uint16_t  TDEAD          : 6; //  5:0    dead time
    uint16_t  NFLT2_DOUT_MUX : 1; //  6         nFLT2/DOUT pin function
    uint16_t  rsvd7          : 1; //  7      PVDD ov flag
    uint16_t  OV1_DIS        : 1; //  8      VCC1 OVLO disable
    uint16_t  rsvd9          : 1; //  9      PVDD ov flag
    uint16_t  GD_TWN_DIS     : 1; // 10         OTW VCC1 side
    uint16_t  IO_DEGLITCH    : 2; // 12:11   IN deglitch time
    uint16_t  OVLO1_LEVEL    : 1; // 13      VCC1 OVLO setting
    uint16_t  UVLO1_LEVEL    : 1; // 14      VCC1 UVLO setting
    uint16_t  UV1_DIS        : 1; // 15      VCC1 UVLO disable
};

typedef union
{
   uint16_t                      all;
   struct UCC5870_CFG1_REG_BITS    bit;
} UCC5870_CFG1_REG;

//
// T in ns
//
#define  Tdead(T)   ( ((T - 105) / 70) + 1)

enum {
    nFLT2_DOUT_nFLT2 = 0,
    nFLT2_DOUT_DOUT  = 1
};

enum {
    vcc1_ovlo_enable  = 0,
    vcc1_ovlo_disable = 1
};

enum {
    OT_warning_enable  = 0,
    OT_warning_disable = 1
};

enum {
    io_deglitch_bypass = 0,
    io_deglitch_70ns   = 1,
    io_deglitch_140ns  = 2,
    io_deglitch_210ns  = 3
};

enum {
    vcc1_3V3 = 0,
    vcc1_5v0 = 1
};

enum {
    vcc1_uvlo_enable  = 0,
    vcc1_uvlo_disable = 1
};

//
// UCC5870 CFG2 Register bit definitions:
//
struct  UCC5870_CFG2_REG_BITS
{                                      // bit    description
    uint16_t  PWM_CHK_FAULT      : 1;  //  0      PWM check fault
    uint16_t  VREG1_ILIMIT_FAULT : 1;  //  1      Vreg Ilimit fault
    uint16_t  GD_TWN_FAULT       : 1;  //  2      temp warning fault
    uint16_t  rsvd               : 2;  //  4-3
    uint16_t  BIST_FAULT         : 1;  //  5      Analog BIST fault
    uint16_t  TRIM_CRC_FAULT     : 1;  //  6      TRIM CRC fault
    uint16_t  INT_REG_FAULT      : 1;  //  7      Internal regulator fault
    uint16_t  CFG_CRC_FAULT      : 1;  //  8      CFG reg CRC fault
    uint16_t  SPI_FAULT          : 2;  // 10-9    SPI fault
    uint16_t  CLK_MON_FAULT      : 1;  // 11      Clock monitor fault
    uint16_t  STP_FAULT          : 1;  // 12      STP fault
    uint16_t  UVLO1_FAULT        : 1;  // 13      UVLO fault
    uint16_t  OVLO1_FAULT        : 1;  // 14      OVLO fault
    uint16_t  INT_COMM_FAULT     : 1;  // 15      Inter-die comm failure
};

typedef union
{
    uint16_t                     all;
    struct UCC5870_CFG2_REG_BITS bit;
} UCC5870_CFG2_REG;

enum {
    report_fault_on_nFLT1      = 0,
    dont_report_fault_on_nFLT1 = 1
};

enum {
    dont_report_comm_fault_on_nFLT1 = 0,
    report_comm_fault_on_nFLT1 = 1
};

enum {
    no_warning_on_nFLT1 = 0,
    warning_on_nFLT1 = 1
};

enum {
    report_SPI_fault_on_nFLT1 = 0,
    report_SPI_fault_on_nFLT2 = 1,
    dont_report_SPI_fault     = 2
};

//
// UCC5870 CFG3 Register bit definitions:
//
struct  UCC5870_CFG3_REG_BITS
{                                         // bit     description
    uint16_t  AI_IZTC_SEL             : 3; //  2:0
    uint16_t  FS_STATE_CFG_CRC_FAULT  : 1; //  3
    uint16_t  ITO2_EN                 : 1; //  4
    uint16_t  ITO1_EN                 : 1; //  5
    uint16_t  FS_STATE_INT_COMM_FAULT : 1; //  6
    uint16_t  FS_STATE_INT_REG_FAULT  : 1; //  7
    uint16_t  FS_STATE_SPI_FAULT      : 2; //  9:8
    uint16_t  rsvd10                  : 1; // 10
    uint16_t  FS_STATE_STP_FAULT      : 2; // 12:11
    uint16_t  FS_STATE_PWM_CHK        : 1; // 13
    uint16_t  FS_STATE_OVLO1_FAULT    : 1; // 14
    uint16_t  FS_STATE_UVLO1_FAULT    : 1; // 15
};

typedef union
{
    uint16_t                     all;
    struct UCC5870_CFG3_REG_BITS bit;
} UCC5870_CFG3_REG;

enum {
    AI1_AI3_AI5_bias_currents_off = 0,
    AI1_bias_current_on           = 1,
    AI3_bias_current_on           = 2,
    AI1_AI3_bias_currents_on      = 3,
    AI5_bias_current_on           = 4,
    AI1_AI5_bias_currents_on      = 5,
    AI3_AI5_bias_currents_on      = 6,
    AI1_AI3_AI5_bias_currents_on  = 7
};

enum {
    OUTx_LOW    = 0,
    OUTx_IGNORE = 1
};

enum {
    FS_SPI_OUTx_LOW    = 0,
    FS_SPI_OUTx_HIGH   = 1,
    FS_SPI_OUTx_IGNORE = 2
};

enum {
    FS_STP_OUTx_LOW    = 0,
    FS_STP_OUTx_HIGH   = 1,
    FS_STP_OUTx_IGNORE = 3
};

enum {
    CURRENT_SRC_OUT_AI2_4_6_DISABLED = 0,
    CURRENT_SRC_OUT_AI2_4_6_ENABLED  = 1
};

enum {
    CURRENT_SRC_OUT_AI1_3_5_DISABLED = 0,
    CURRENT_SRC_OUT_AI1_3_5_ENABLED  = 1
};

//
// UCC5870 CFG4 Register bit definitions:
//
struct  UCC5870_CFG4_REG_BITS
{                                  // bit     description
    uint16_t  UVOV3_EN        : 1; //  0
    uint16_t  PS_TSD_EN       : 1; //  1
    uint16_t  OCP_DIS         : 1; //  2
    uint16_t  SCP_DIS         : 1; //  3
    uint16_t  DESAT_EN        : 1; //  4
    uint16_t  VCECLP_EN       : 1; //  5
    uint16_t  MCLP_DIS        : 1; //  6
    uint16_t  GM_EN           : 1; //  7
    uint16_t  GM_BLK          : 2; //  9:8
    uint16_t  MCLP_CFG        : 1; // 10
    uint16_t  OV2_DIS         : 1; // 11
    uint16_t  DESAT_DEGLITCH  : 1; // 12
    uint16_t  PS_TSD_DEGLITCH : 2; // 14:13
    uint16_t  UV2_DIS         : 1; // 15
};

typedef union  {
    uint16_t                     all;
    struct UCC5870_CFG4_REG_BITS bit;
} UCC5870_CFG4_REG;

enum {
    VEE2_uvlo_ovlo_disable = 0,
    VEE2_uvlo_ovlo_enable = 1
};

enum {
    Switch_thermal_SD_disable = 0,
    Switch_thermal_SD_enable = 1
};

enum {
    OCP_enable = 0,
    OCP_disable = 1
};

enum {
    SCP_enable = 0,
    SCP_disable = 1
};

enum {
    DESAT_det_disable = 0,
    DESAT_det_enable = 1
};

enum {
    VCE_CLAMP_disable = 0,
    VCE_CLAMP_enable = 1
};

enum {
    MILLER_CLAMP_enable = 0,
    MILLER_CLAMP_disable = 1
};

enum {
    Gate_Volt_Mon_enable = 0,
    Gate_Volt_Mon_disable = 1
};

enum {
    Gate_volt_mon_blank_500ns  = 0,
    Gate_volt_mon_blank_1000ns = 1,
    Gate_volt_mon_blank_2500ns = 2,
    Gate_volt_mon_blank_4000ns = 3
};

enum {
    MILLER_CLAMP_internal = 0,
    MILLER_CLAMP_external = 1
};

enum {
    VCC2_ovlo_enable = 0,
    VCC2_ovlo_disable = 1
};

enum {
    DESAT_deglitch_158ns = 0,
    DESAT_deglitch_316ns = 1
};

enum {
    TSD_250ns = 0,
    TSD_500ns = 1,
    TSD_750ns = 2,
    TSD_1000ns = 3
};

enum {
    VCC2_uvlo_enable = 0,
    VCC2_uvlo_disable = 1
};


//
// UCC5870 CFG5 Register bit definitions:
//
struct  UCC5870_CFG5_REG_BITS
{                                  // bit     description
    uint16_t  PWM_MUTE_EN     : 1; //  0
    uint16_t  TLTOFF_STO_EN   : 3; //  3:1
    uint16_t  STO_CURR        : 2; //  5:4
    uint16_t  MCLPTH          : 2; //  7:6
    uint16_t  DESAT_DCHG_EN   : 1; //  8
    uint16_t  DESAT_CHG_CURR  : 2; // 10:9
    uint16_t  DESATTH         : 4; // 14:11
    uint16_t  GM_STO2LTO_DIS  : 1; // 15
};

typedef union
{
    uint16_t                     all;
    struct UCC5870_CFG5_REG_BITS bit;
} UCC5870_CFG5_REG;

enum {
    PWM_MUTE_FOR_SC_OC_OT_FAULTS_DISABLED = 0,
    PWM_MUTE_FOR_SC_OC_OT_FAULTS_ENABLED  = 1
};

enum {
    STO_2LTOFF_DISABLED        = 0,
    STO_FOR_SC_DESAT           = 1,
    STO_FOR_SC_DESAT_OC        = 2,
    STO_FOR_SC_DESAT_OC_TSD    = 3,
    TLTOFF_FOR_SC_DESAT        = 5,
    TLTOFF_FOR_SC_DESAT_OC     = 6,
    TLTOFF_FOR_SC_DESAT_OC_TSD = 7
};

enum {
    SOFT_TURN_OFF_0_3A = 0,
    SOFT_TURN_OFF_0_6A = 1,
    SOFT_TURN_OFF_0_9A = 2,
    SOFT_TURN_OFF_1_2A = 3
};

enum {
    MILLER_CLAMP_VTH_1p5V = 0,
    MILLER_CLAMP_VTH_2V   = 1,
    MILLER_CLAMP_VTH_3V   = 2,
    MILLER_CLAMP_VTH_4V   = 3
};

enum {
    DESAT_DISCHARGE_DISABLE = 0,
    DESAT_DISCHARGE_ENABLE  = 1
};

enum {
    BLANK_CAP_CHRG_CUR_600uA = 0,
    BLANK_CAP_CHRG_CUR_700uA = 1,
    BLANK_CAP_CHRG_CUR_800uA = 2,
    BLANK_CAP_CHRG_CUR_1000uA = 3,
};

enum {
    DESAT_VTH_2p5 = 0,
    DESAT_VTH_3p0 = 1,
    DESAT_VTH_3p5 = 2,
    DESAT_VTH_4p0 = 3,
    DESAT_VTH_4p5 = 4,
    DESAT_VTH_5p0 = 5,
    DESAT_VTH_5p5 = 6,
    DESAT_VTH_6p0 = 7,
    DESAT_VTH_6p5 = 8,
    DESAT_VTH_7p0 = 9,
    DESAT_VTH_7p5 = 10,
    DESAT_VTH_8p0 = 11,
    DESAT_VTH_8p5 = 12,
    DESAT_VTH_9p0 = 13,
    DESAT_VTH_9p5 = 14,
    DESAT_VTH_10p0 = 15,
};

enum {
    GATE_MON_FLT_DURING_STO_TLTOFF_ENABLED = 0,
    GATE_MON_FLT_DURING_STO_TLTOFF_DISABLED = 1
};

//
// UCC5870 CFG6 Register bit definitions:
//
struct  UCC5870_CFG6_REG_BITS
{                                 // bit     description
    uint16_t  PS_TSDTH   : 3;     //  2:0
    uint16_t  TEMP_CURR  : 2;     //  4:3
    uint16_t  OC_BLK     : 3;     //  7:5
    uint16_t  SC_BLK     : 2;     //  9:8
    uint16_t  SCTH       : 2;     // 11:10
    uint16_t  OCTH       : 4;     // 15:12
};

typedef union  {
    uint16_t                     all;
    struct UCC5870_CFG6_REG_BITS bit;
} UCC5870_CFG6_REG;

enum {
    TSD_TH_1p00 = 0,
    TSD_TH_1p25 = 1,
    TSD_TH_1p50 = 2,
    TSD_TH_1p75 = 3,
    TSD_TH_2p00 = 4,
    TSD_TH_2p25 = 5,
    TSD_TH_2p50 = 6,
    TSD_TH_2p75 = 7
};

enum {
    TEMP_CURR_0p1A = 0,
    TEMP_CURR_0p3A = 1,
    TEMP_CURR_0p5A = 2,
    TEMP_CURR_1p0A = 3
};

enum {
    OCD_BLANK_TIME_0p5us = 0,
    OCD_BLANK_TIME_1p0us = 1,
    OCD_BLANK_TIME_1p5us = 2,
    OCD_BLANK_TIME_2p0us = 3,
    OCD_BLANK_TIME_2p5us = 4,
    OCD_BLANK_TIME_3p0us = 5,
    OCD_BLANK_TIME_5p0us = 6,
    OCD_BLANK_TIME_10p0us = 7
};

enum {
    SCD_BLANK_TIME_0p1us = 0,
    SCD_BLANK_TIME_0p2us = 1,
    SCD_BLANK_TIME_0p4us = 2,
    SCD_BLANK_TIME_0p8us = 3
};

enum {
    SCD_VTH_0p5V  = 0,
    SCD_VTH_0p75V = 1,
    SCD_VTH_1p0V  = 2,
    SCD_VTH_1p25V = 3
};

enum {
    OCD_VTH_0p2V  = 0,
    OCD_VTH_0p25V = 1,
    OCD_VTH_0p3V  = 2,
    OCD_VTH_0p35V = 3,
    OCD_VTH_0p4V  = 4,
    OCD_VTH_0p45V = 5,
    OCD_VTH_0p5V  = 6,
    OCD_VTH_0p55V = 7,
    OCD_VTH_0p6V  = 8,
    OCD_VTH_0p65V = 9,
    OCD_VTH_0p7V  = 10,
    OCD_VTH_0p75V = 11,
    OCD_VTH_0p8V  = 12,
    OCD_VTH_0p85V = 13,
    OCD_VTH_0p9V  = 14,
    OCD_VTH_0p95V = 15
};

//
// UCC5870 CFG7 Register bit definitions:
//
struct  UCC5870_CFG7_REG_BITS
{                                     // bit     description
    uint16_t  FS_STATE_ADC_FAULT : 2; // 1:0
    uint16_t  ADC_FAULT_P        : 1; //  2
    uint16_t  ADC_SAMP_DLY       : 2; //  4:3
    uint16_t  ADC_SAMP_MODE      : 2; //  6:5
    uint16_t  ADC_EN             : 1; //  7
    uint16_t  OVLO3TH            : 2; //  9:8
    uint16_t  UVLO3TH            : 2; // 11:10
    uint16_t  OVLO2TH            : 2; // 13:12
    uint16_t  UVLO2TH            : 2; // 15:14
};

typedef union  {
    uint16_t                     all;
    struct UCC5870_CFG7_REG_BITS bit;
} UCC5870_CFG7_REG;

enum {
    FS_ADC_FLT_OUT_LOW    = 0,
    FS_ADC_FLT_OUT_HIGH   = 1,
    FS_ADC_FLT_OUT_HiZ    = 2,
    FS_ADC_FLT_OUT_IGNORE = 3
};

enum {
    dont_report_adcfault_on_nFLT1 = 0,
    report_adcfault_on_nFLT1      = 1
};

enum {
    ADC_SAMP_DELAY_280ns = 0,
    ADC_SAMP_DELAY_560ns = 1,
    ADC_SAMP_DELAY_840ns = 2,
    ADC_SAMP_DELAY_1120ns = 3
};

enum {
    ADC_SAMP_CENTER_ALIGN  = 0,
    ADC_SAMP_EDGE_ALIGN    = 1,
    ADC_SAMP_CENTER_HYBRID = 2,
    ADC_SAMP_RESERVED      = 3
};

enum {
    ADC_SAMP_DISABLE = 0,
    ADC_SAMP_ENABLE  = 1
};

enum {
    VEE2_OVLO_VTH_M5V  = 0,
    VEE2_OVLO_VTH_M7V  = 1,
    VEE2_OVLO_VTH_M10V = 2,
    VEE2_OVLO_VTH_M12V = 3
};

enum {
    VEE2_UVLO_VTH_M3V  = 0,
    VEE2_UVLO_VTH_M5V  = 1,
    VEE2_UVLO_VTH_M8V  = 2,
    VEE2_UVLO_VTH_M10V = 3
};

enum {
    VCC2_OVLO_VTH_P23V  = 0,
    VCC2_OVLO_VTH_P21V  = 1,
    VCC2_OVLO_VTH_P19V  = 2,
    VCC2_OVLO_VTH_P17V  = 3
};

enum {
    VCC2_UVLO_VTH_P16V  = 0,
    VCC2_UVLO_VTH_P14V  = 1,
    VCC2_UVLO_VTH_P12V  = 2,
    VCC2_UVLO_VTH_P10V  = 3
};

//
// UCC5870 CFG8 Register bit definitions:
//
struct  UCC5870_CFG8_REG_BITS
{                                      // bit     description
    uint16_t  IOUT_SEL         : 3;    //  2:0
    uint16_t  AI_ASC_MUX       : 1;    //  3
    uint16_t  VREF_SEL         : 1;    //  4
    uint16_t  GD_2LOFF_STO_EN  : 1;    //  5
    uint16_t  CRC_DIS          : 1;    //  6
    uint16_t  rsvd7            : 1;    //  7
    uint16_t  GD_2LOFF_CURR    : 2;    //  9:8
    uint16_t  GD_2LOFF_TIME    : 3;    // 12:10
    uint16_t  GD_2LOFF_VOLT    : 3;    // 15:13
};

typedef union  {
    uint16_t                     all;
    struct UCC5870_CFG8_REG_BITS bit;
} UCC5870_CFG8_REG;

enum {
    GATE_DRIVE_STRENGTH_FULL = 0,
    GATE_DRIVE_STRENGTH_3rd  = 1,
    GATE_DRIVE_STRENGTH_6th  = 2
};

enum {
    AI_ASC_MUX_ASC = 0,
    AI_ASC_MUX_AI  = 1
};

enum {
    VREF_INTERNAL = 0,
    VREF_EXTERNAL = 1
};

enum {
    GD_2LOFF_STO_DISABLE = 0,
    GD_2LOFF_STO_ENABLE  = 1
};

enum {
    CRC_CHECK_ENABLE  = 0,
    CRC_CHECK_DISABLE = 1
};

enum {
    GD_2LOFF_DISCHARGE_CURR_0p3A = 0,
    GD_2LOFF_DISCHARGE_CURR_0p6A = 1,
    GD_2LOFF_DISCHARGE_CURR_0p9A = 2,
    GD_2LOFF_DISCHARGE_CURR_1p2A = 3
};

enum {
    GD_2LOFF_PLATEAU_TIME_150ns  = 0,
    GD_2LOFF_PLATEAU_TIME_300ns  = 1,
    GD_2LOFF_PLATEAU_TIME_450ns  = 2,
    GD_2LOFF_PLATEAU_TIME_600ns  = 3,
    GD_2LOFF_PLATEAU_TIME_1000ns = 4,
    GD_2LOFF_PLATEAU_TIME_1500ns = 5,
    GD_2LOFF_PLATEAU_TIME_2000ns = 6,
    GD_2LOFF_PLATEAU_TIME_2500ns = 7
};

enum {
    GD_2LOFF_PLATEAU_VOLT_6V = 0,
    GD_2LOFF_PLATEAU_VOLT_7V = 1,
    GD_2LOFF_PLATEAU_VOLT_8V = 2,
    GD_2LOFF_PLATEAU_VOLT_9V = 3,
    GD_2LOFF_PLATEAU_VOLT_10V = 4,
    GD_2LOFF_PLATEAU_VOLT_11V = 5,
    GD_2LOFF_PLATEAU_VOLT_12V = 6,
    GD_2LOFF_PLATEAU_VOLT_13V = 7

