Rlesjak/am263_tractionDemo/libraries/ucc5870/include/ucc5870_regs.h
};

//
// UCC5870 CFG9 Register bit definitions:
//
struct  UCC5870_CFG9_REG_BITS
{                                      // bit     description
    uint16_t  CLK_MON_SEC_FAULT  : 1;  //  0
    uint16_t  VREG2_ILIMIT_FAULT : 1;  //  1
    uint16_t  BIST_SEC_FAULT     : 1;  //  2
    uint16_t  INT_REG_SEC_FAULT  : 1;  //  3
    uint16_t  TRIM_CRC_SEC_FAULT : 1;  //  4
    uint16_t  CFG_CRC_SEC_FAULT  : 1;  //  5
    uint16_t  INT_COMM_SEC_FAULT : 1;  //  6
    uint16_t  GD_TSD_FAULT       : 1;  //  7
    uint16_t  PS_TSD_FAULT       : 1;  //  8
    uint16_t  OVLO23_FAULT       : 1;  //  9
    uint16_t  UVLO23_FAULT       : 1;  // 10
    uint16_t  GM_FAULT           : 2;  // 12:11
    uint16_t  OC_FAULT           : 1;  // 13
    uint16_t  SC_FAULT           : 1;  // 14
    uint16_t  SPARE              : 1;  // 15
};

typedef union  {
    uint16_t                     all;
    struct UCC5870_CFG9_REG_BITS bit;
} UCC5870_CFG9_REG;

enum {
    GM_FAULT_IGNORE   = 0,
    GM_FAULT_ON_nFLT1 = 1,
    GM_FAULT_ON_nFLT2 = 2,
    GM_STATE_ON_nFLT2 = 3
};

enum {
    dont_report_TSD_on_nFLT1 = 0,
    report_TSD_on_nFLT1 = 1
};

//
// UCC5870 CFG10 Register bit definitions:
//
struct  UCC5870_CFG10_REG_BITS
{                                         // bit     description
    uint16_t  FS_STATE_INT_COMM_SEC  : 2; //  1:0
    uint16_t  FS_STATE_GM            : 2; //  3:2
    uint16_t  FS_STATE_GD_TSD        : 2; //  5:4
    uint16_t  FS_STATE_PS_TSD        : 2; //  7:6
    uint16_t  FS_STATE_OCP           : 2; //  9:8
    uint16_t  rsvd10                 : 1; // 10
    uint16_t  FS_STATE_INT_REG_FAULT : 1; // 11
    uint16_t  FS_STATE_DESAT_SCP     : 2; // 13:12
    uint16_t  SPARE                  : 1; // 14
    uint16_t  GD_TWN_SEC_EN          : 1; // 15
};

typedef union  {
    uint16_t                      all;
    struct UCC5870_CFG10_REG_BITS bit;
} UCC5870_CFG10_REG;

enum {
    PULLED_LOW = 0,
    PULLED_HIGH = 1,
    NO_ACTION = 3
};

enum {
    GD_TWN_SEC_DISABLED = 0,
    GD_TWN_SEC_ENABLED  = 1
};

//
// UCC5870 CFG11 Register bit definitions:
//
struct  UCC5870_CFG11_REG_BITS
{                                               // bit     description
    uint16_t  FS_STATE_CLK_MON_SEC_FAULT  : 2;  //  1:0
    uint16_t  VCE_CLMP_HLD_TIME           : 2;  //  3:2
    uint16_t  FS_STATE_CFG_CRC_SEC_FAULT  : 2;  //  5:4
    uint16_t  FS_STATE_TRIM_CRC_SEC_FAULT : 2;  //  7:6
    uint16_t  FS_STATE_OVLO3              : 2;  //  9:8
    uint16_t  FS_STATE_UVLO3              : 2;  // 11:10
    uint16_t  FS_STATE_OVLO2              : 2;  // 13:12
    uint16_t  FS_STATE_UVLO2              : 2;  // 15:14
};

typedef union  {
    uint16_t                      all;
    struct UCC5870_CFG11_REG_BITS bit;
} UCC5870_CFG11_REG;

enum {
    VCE_CLAMP_HOLD_TIME_100ns = 0,
    VCE_CLAMP_HOLD_TIME_200ns = 1,
    VCE_CLAMP_HOLD_TIME_300ns = 2,
    VCE_CLAMP_HOLD_TIME_400ns = 3
};

//
// UCC5870 ADCDATA1 Register bit definitions:
//
struct  UCC5870_ADCDATA1_REG_BITS
{                                // bit     description
    uint16_t DATA_AI1   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA1_REG_BITS bit;
} UCC5870_ADCDATA1_REG;

//
// UCC5870 ADCDATA2 Register bit definitions:
//
struct  UCC5870_ADCDATA2_REG_BITS
{                                // bit     description
    uint16_t DATA_AI3   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA2_REG_BITS bit;
} UCC5870_ADCDATA2_REG;

//
// UCC5870 ADCDATA3 Register bit definitions:
//
struct  UCC5870_ADCDATA3_REG_BITS
{                                // bit     description
    uint16_t DATA_AI5   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA3_REG_BITS bit;
} UCC5870_ADCDATA3_REG;

//
// UCC5870 ADCDATA4 Register bit definitions:
//
struct  UCC5870_ADCDATA4_REG_BITS
{                                // bit     description
    uint16_t DATA_AI2   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA4_REG_BITS bit;
} UCC5870_ADCDATA4_REG;

//
// UCC5870 ADCDATA5 Register bit definitions:
//
struct  UCC5870_ADCDATA5_REG_BITS
{                                // bit     description
    uint16_t DATA_AI4   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA5_REG_BITS bit;
} UCC5870_ADCDATA5_REG;

//
// UCC5870 ADCDATA6 Register bit definitions:
//
struct  UCC5870_ADCDATA6_REG_BITS
{                                // bit     description
    uint16_t DATA_AI6   : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA6_REG_BITS bit;
} UCC5870_ADCDATA6_REG;

//
// UCC5870 ADCDATA7 Register bit definitions:
//
struct  UCC5870_ADCDATA7_REG_BITS
{                                // bit     description
    uint16_t DATA_DTEMP : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA7_REG_BITS bit;
} UCC5870_ADCDATA7_REG;

//
// UCC5870 ADCDATA8 Register bit definitions:
//
struct  UCC5870_ADCDATA8_REG_BITS
{                                // bit     description
    uint16_t DATA_OUTH  : 10;    //  9-0
    uint16_t TIME_STAMP :  6;    // 15-10
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_ADCDATA8_REG_BITS bit;
} UCC5870_ADCDATA8_REG;

//
// UCC5870 CRCDATA Register bit definitions:
//
struct  UCC5870_CRCDATA_REG_BITS
{                            // bit     description
    uint16_t CRC_RX : 8;     //  7-0
    uint16_t CRC_TX : 8;     // 15-8
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_CRCDATA_REG_BITS bit;
} UCC5870_CRCDATA_REG;

//
// UCC5870 SPITEST Register bit definitions:
//
struct  UCC5870_SPITEST_REG_BITS
{                           // bit     description
    uint16_t rsvd:16;       // 15-10
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_SPITEST_REG_BITS bit;
} UCC5870_SPITEST_REG;

//
// UCC5870 GD_ADDR Register bit definitions:
//
struct  UCC5870_GD_ADDR_REG_BITS
{                              // bit     description
    uint16_t GD_ADDRESS :  4;     //  3-0
    uint16_t rsvd       : 12;     // 15-4
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_GD_ADDR_REG_BITS bit;
} UCC5870_GD_ADDR_REG;

//
// UCC5870 STATUS1 Register bit definitions:
//
struct  UCC5870_STATUS1_REG_BITS
{                                       // bit     description
    uint16_t  rsvd0              : 1;   //  0
    uint16_t  GD_TWN_FAULT       : 1;   //  1
    uint16_t  rsvd2              : 3;   //  4:2
    uint16_t  PWM_COMP_CHK_FAULT : 1;   //  5
    uint16_t  OPM                : 3;   //  8:6
    uint16_t  rsvd9              : 2;   // 10:9
    uint16_t  EN_STATE           : 1;   // 11
    uint16_t  rsvd12             : 2;   // 13:12
    uint16_t  INN_STATE          : 1;   // 14
    uint16_t  INP_STATE          : 1;   // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_STATUS1_REG_BITS bit;
} UCC5870_STATUS1_REG;

enum {
    NO_FAULT = 0,
    FAULT    = 1
};

enum {
    LOW  = 0,
    HIGH = 1
};

enum {
    OP_MODE_ERROR0 = 0,
    OP_MODE_CFG1   = 1,
    OP_MODE_CFG2   = 2,
    OP_MODE_ACTIVE = 3,
    OP_MODE_ERROR4 = 4,
    OP_MODE_ERROR5 = 5,
    OP_MODE_ERROR6 = 6,
    OP_MODE_ERROR7 = 7
};

//
// UCC5870 STATUS1 Register's FAULT bit mask definitions
//
#define  GD_TWN_FAULT_MASK         (1U << 1)
#define  PWM_COMP_CHK_FAULT_MASK   (1U << 5)

//
// UCC5870 STATUS2 Register bit definitions:
//
struct  UCC5870_STATUS2_REG_BITS
{                                   // bit     description
    uint16_t  OR_NFLT2_PRI   : 1;   //  0
    uint16_t  OR_NFLT1_PRI   : 1;   //  1
    uint16_t  DRV_EN_RCVD    : 1;   //  2
    uint16_t  TRIM_CRC_FAULT : 1;   //  3
    uint16_t  CFG_CRC_FAULT  : 1;   //  4
    uint16_t  CLK_MON_FAULT  : 1;   //  5
    uint16_t  BIST_FAULT     : 1;   //  6
    uint16_t  INT_COMM_FAULT : 1;   //  7
    uint16_t  INT_REG_FAULT  : 1;   //  8
    uint16_t  SPI_FAULT      : 1;   //  9
    uint16_t  rsvd10         : 1;   // 10
    uint16_t  STP_FAULT      : 1;   // 11
    uint16_t  OVLO1_FAULT    : 1;   // 12
    uint16_t  UVLO1_FAULT    : 1;   // 13
    uint16_t  PRI_RDY        : 1;   // 14
    uint16_t  rsvd15         : 1;   // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_STATUS2_REG_BITS bit;
} UCC5870_STATUS2_REG;

enum {
    NOT_READY = 0,
    READY     = 1
};

enum {
    DRIVER_NOT_ENABLED = 0,
    DRIVER_ENABLED     = 1
};

//
// UCC5870 STATUS2 Register's FAULT bit mask definitions
//
#define  OR_NFLT2_MASK            (1U << 0)
#define  OR_NFLT1_MASK            (1U << 1)
#define  TRIM_CRC_FAULT_MASK      (1U << 3)
#define  CFG_CRC_FAULT_MASK       (1U << 4)
#define  CLK_MON_FAULT_MASK       (1U << 5)
#define  BIST_FAULT_MASK          (1U << 6)
#define  INT_COMM_FAULT_MASK      (1U << 7)
#define  INT_REG_FAULT_MASK       (1U << 8)
#define  SPI_FAULT_MASK           (1U << 9)
#define  STP_FAULT_MASK           (1U << 11)
#define  OVLO1_FAULT_MASK         (1U << 12)
#define  UVLO1_FAULT_MASK         (1U << 13)

//
// UCC5870 STATUS3 Register bit definitions:
//
struct  UCC5870_STATUS3_REG_BITS
{                                      // bit     description
    uint16_t  DESAT_FAULT        : 1;  //  0
    uint16_t  OC_FAULT           : 1;  //  1
    uint16_t  SC_FAULT           : 1;  //  2
    uint16_t  VREG2_ILIMIT_FAULT : 1;  //  3
    uint16_t  rsvd4              : 1;  //  4
    uint16_t  PS_TSD_FAULT       : 1;  //  5
    uint16_t  VCEOV_FAULT        : 1;  //  6
    uint16_t  UVLO2_FAULT        : 1;  //  7
    uint16_t  OVLO2_FAULT        : 1;  //  8
    uint16_t  UVLO3_FAULT        : 1;  //  9
    uint16_t  OVLO3_FAULT        : 1;  // 10
    uint16_t  MCLP_STATE         : 1;  // 11
    uint16_t  INT_COMM_SEC_FAULT : 1;  // 12
    uint16_t  INT_REG_SEC_FAULT  : 1;  // 13
    uint16_t  GM_FAULT           : 1;  // 14
    uint16_t  GM_STATE           : 1;  // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_STATUS3_REG_BITS bit;
} UCC5870_STATUS3_REG;

enum {
    NOT_ACTIVE = 0,
    ACTIVE     = 1
};

//
// UCC5870 STATUS3 Register's FAULT bit mask definitions
//
#define  DESAT_FAULT_MASK         (1U << 0)
#define  OC_FAULT_MASK            (1U << 1)
#define  SC_FAULT_MASK            (1U << 2)
#define  VREG2_ILIMIT_FAULT_MASK  (1U << 3)
#define  PS_TSD_FAULT_MASK        (1U << 5)
#define  VCEOV_FAULT_MASK         (1U << 6)
#define  UVLO2_FAULT_MASK         (1U << 7)
#define  OVLO2_FAULT_MASK         (1U << 8)
#define  UVLO3_FAULT_MASK         (1U << 9)
#define  OVLO3_FAULT_MASK         (1U << 10)
#define  MCLP_STATE_MASK          (1U << 11)
#define  INT_COMM_SEC_FAULT_MASK  (1U << 12)
#define  INT_REG_SEC_FAULT_MASK   (1U << 13)
#define  GM_FAULT_MASK            (1U << 14)

//
// UCC5870 STATUS4 Register bit definitions:
//
struct  UCC5870_STATUS4_REG_BITS
{                                    // bit     description
    uint16_t  SEC_RDY           : 1;  //  0
    uint16_t  rsvd              : 4;  //  4:1
    uint16_t  RIM_CRC_SEC_FAULT : 1;  //  5
    uint16_t  CFG_CRC_SEC_FAULT : 1;  //  6
    uint16_t  CLK_MON_SEC_FAULT : 1;  //  7
    uint16_t  BIST_SEC_FAULT    : 1;  //  8
    uint16_t  OR_NFLT2_SEC      : 1;  //  9
    uint16_t  OR_NFLT1_SEC      : 1;  // 10
    uint16_t  rsvd11            : 1;  // 11
    uint16_t  GD_TSD_SEC_FAULT  : 1;  // 12
    uint16_t  GD_TWN_SEC_FAULT  : 1;  // 13
    uint16_t  VCE_STATE         : 1;  // 14
    uint16_t  rsvd15            : 1;  // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_STATUS4_REG_BITS bit;
} UCC5870_STATUS4_REG;

//
// UCC5870 STATUS4 Register's FAULT bit mask definitions
//
#define  RIM_CRC_SEC_FAULT_MASK   (1U << 5)
#define  CFG_CRC_SEC_FAULT_MASK   (1U << 6)
#define  CLK_MON_SEC_FAULT_MASK   (1U << 7)
#define  BIST_SEC_FAULT_MASK      (1U << 8)
#define  OR_NFLT2_SEC_MASK        (1U << 9)
#define  OR_NFLT1_SEC_MASK        (1U << 10)
#define  GD_TSD_SEC_FAULT_MASK    (1U << 12)
#define  GD_TWN_SEC_FAULT_MASK    (1U << 13)

//
// UCC5870 STATUS5 Register bit definitions:
//
struct  UCC5870_STATUS5_REG_BITS
{                                // bit     description
    uint16_t rsvd      : 15;     // 14-0
    uint16_t ADC_FAULT :  1;     // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_STATUS5_REG_BITS bit;
} UCC5870_STATUS5_REG;

//
// UCC5870 STATUS5 Register's FAULT bit mask definitions
//
#define ADC_FAULT_MASK            (1U << 15)

//
// UCC5870 CONTROL1 Register bit definitions:
//
struct  UCC5870_CONTROL1_REG_BITS
{                                  // bit     description
    uint16_t  CLK_MON_CHK_PRI : 1; //  0
    uint16_t  rsvd4           : 4; //  4:1
    uint16_t  STP_CHK         : 1; //  5
    uint16_t  rsvd6           : 1; //  6
    uint16_t  PWM_COMP_CHK    : 1; //  7
    uint16_t  CFG_CRC_CHK_PRI : 1; //  8
    uint16_t  rsvd14          : 6; // 14-9
    uint16_t  CLR_SPI_CRC     : 1; // 15
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_CONTROL1_REG_BITS bit;
} UCC5870_CONTROL1_REG;

//
// UCC5870 CONTROL2 Register bit definitions:
//
struct  UCC5870_CONTROL2_REG_BITS
{                                   // bit     description
    uint16_t  rsvd0           : 1;  //  0
    uint16_t  PS_TSD_CHK_SEC  : 1;  //  1
    uint16_t  CFG_CRC_CHK_SEC : 1;  //  2
    uint16_t  CLK_MON_CHK_SEC : 1;  //  3
    uint16_t  RESERVED4       : 1;  //  4
    uint16_t  VGTH_MEAS       : 1;  //  5
    uint16_t  rsvd6           : 1;  //  6
    uint16_t  OCP_CHK         : 1;  //  7
    uint16_t  SCP_CHK         : 1;  //  8
    uint16_t  DESAT_CHK       : 1;  //  9
    uint16_t  rsvd10          : 1;  // 10
    uint16_t  VCECLP_CHK      : 1;  // 11
    uint16_t  GATE_ON_CHK     : 1;  // 12
    uint16_t  GATE_OFF_CHK    : 1;  // 13
    uint16_t  rsvd14          : 1;  // 14
    uint16_t  CLR_STAT_REG    : 1;  // 15
};

typedef union  {
    uint16_t                         all;
    struct UCC5870_CONTROL2_REG_BITS bit;
} UCC5870_CONTROL2_REG;

//
// UCC5870 ADCCFG Register bit definitions:
//
struct  UCC5870_ADCCFG_REG_BITS
{                                     // bit     description
    uint16_t  rsvd0            : 1;   //  0
    uint16_t  ADC_ON_CH_SEL_7  : 1;   //  1
    uint16_t  ADC_ON_CH_SEL_6  : 1;   //  2
    uint16_t  ADC_ON_CH_SEL_5  : 1;   //  3
    uint16_t  ADC_ON_CH_SEL_4  : 1;   //  4
    uint16_t  ADC_ON_CH_SEL_3  : 1;   //  5
    uint16_t  ADC_ON_CH_SEL_2  : 1;   //  6
    uint16_t  ADC_ON_CH_SEL_1  : 1;   //  7
    uint16_t  rsvd7            : 1;   //  8
    uint16_t  ADC_OFF_CH_SEL_7 : 1;   //  9
    uint16_t  ADC_OFF_CH_SEL_6 : 1;   // 10
    uint16_t  ADC_OFF_CH_SEL_5 : 1;   // 11
    uint16_t  ADC_OFF_CH_SEL_4 : 1;   // 12
    uint16_t  ADC_OFF_CH_SEL_3 : 1;   // 13
    uint16_t  ADC_OFF_CH_SEL_2 : 1;   // 14
    uint16_t  ADC_OFF_CH_SEL_1 : 1;   // 15
};

typedef union  {
    uint16_t                       all;
    struct UCC5870_ADCCFG_REG_BITS bit;
} UCC5870_ADCCFG_REG;

enum {
    DONT_SAMPLE_CH = 0,
    SAMPLE_CH      = 1
};

//
// UCC5870 DOUTCFG Register bit definitions:
//
struct  UCC5870_DOUTCFG_REG_BITS
{                               // bit     description
    uint16_t  DOUT_TO_AI1 : 1;  //  0
    uint16_t  DOUT_TO_AI3 : 1;  //  1
    uint16_t  DOUT_TO_AI5 : 1;  //  2
    uint16_t  DOUT_TO_AI2 : 1;  //  3
    uint16_t  DOUT_TO_AI4 : 1;  //  4
    uint16_t  DOUT_TO_AI6 : 1;  //  5
    uint16_t  DOUT_TO_TJ  : 1;  //  6
    uint16_t  rsvd        : 1;  //  7
    uint16_t  FREQ_DOUT   : 2;  //  9:8
    uint16_t  AI6OCSC_EN  : 1;  // 10
    uint16_t  AI4OCSC_EN  : 1;  // 11
    uint16_t  AI2OCSC_EN  : 1;  // 12
    uint16_t  AI5OT_EN    : 1;  // 13
    uint16_t  AI3OT_EN    : 1;  // 14
    uint16_t  AI1OT_EN    : 1;  // 15
};

typedef union  {
    uint16_t                        all;
    struct UCC5870_DOUTCFG_REG_BITS bit;
} UCC5870_DOUTCFG_REG;

enum {
    PROT_DISABLED = 0,
    PROT_ENABLED  = 1
};

enum {
    FREQ_DOUT_13p9KHz = 0,
    FREQ_DOUT_27p8KHz = 1,
    FREQ_DOUT_55p7KHz = 2,
    FREQ_DOUT_111p4KHz = 3
};

enum {
    DONT_CONNECT_TO_DOUT = 0,
    CONNECT_TO_DOUT      = 1
};

typedef struct  {
    UCC5870_CFG1_REG          cfg1;         // 0x00
    UCC5870_CFG2_REG          cfg2;         // 0x01
    UCC5870_CFG3_REG          cfg3;         // 0x02
    UCC5870_CFG4_REG          cfg4;         // 0x03
    UCC5870_CFG5_REG          cfg5;         // 0x04
    UCC5870_CFG6_REG          cfg6;         // 0x05
    UCC5870_CFG7_REG          cfg7;         // 0x06
    UCC5870_CFG8_REG          cfg8;         // 0x07
    UCC5870_CFG9_REG          cfg9;         // 0x08
    UCC5870_CFG10_REG         cfg10;        // 0x09
    UCC5870_CFG11_REG         cfg11;        // 0x0a
    UCC5870_ADCDATA1_REG      adcdata1;     // 0x0b
    UCC5870_ADCDATA2_REG      adcdata2;     // 0x0c
    UCC5870_ADCDATA3_REG      adcdata3;     // 0x0d
    UCC5870_ADCDATA4_REG      adcdata4;     // 0x0e
    UCC5870_ADCDATA5_REG      adcdata5;     // 0x0f
    UCC5870_ADCDATA6_REG      adcdata6;     // 0x10
    UCC5870_ADCDATA7_REG      adcdata7;     // 0x11
    UCC5870_ADCDATA8_REG      adcdata8;     // 0x12
    UCC5870_CRCDATA_REG       crcdata;      // 0x13
    UCC5870_SPITEST_REG       spitest;      // 0x14
    UCC5870_GD_ADDR_REG       gd_address;   // 0x15
    UCC5870_STATUS1_REG       status1;      // 0x16
    UCC5870_STATUS2_REG       status2;      // 0x17
    UCC5870_STATUS3_REG       status3;      // 0x18
    UCC5870_STATUS4_REG       status4;      // 0x19
    UCC5870_STATUS5_REG       status5;      // 0x1a
    UCC5870_CONTROL1_REG      control1;     // 0x1b
    UCC5870_CONTROL2_REG      control2;     // 0x1c
    UCC5870_ADCCFG_REG        adccfg;       // 0x1d
    UCC5870_DOUTCFG_REG       doutcfg;      // 0x1e
} UCC5870_Vars;

static inline void initUcc5870Vars(UCC5870_Vars *ucc5870)
{
    ucc5870->cfg1.all         = 0U;
    ucc5870->cfg2.all         = 0U;
    ucc5870->cfg3.all         = 0U;
    ucc5870->cfg4.all         = 0U;
    ucc5870->cfg5.all         = 0U;
    ucc5870->cfg6.all         = 0U;
    ucc5870->cfg7.all         = 0U;
    ucc5870->cfg8.all         = 0U;
    ucc5870->cfg9.all         = 0U;
    ucc5870->cfg10.all        = 0U;
    ucc5870->cfg11.all        = 0U;
    ucc5870->adcdata1.all     = 0U;
    ucc5870->adcdata2.all     = 0U;
    ucc5870->adcdata3.all     = 0U;
    ucc5870->adcdata4.all     = 0U;
    ucc5870->adcdata5.all     = 0U;
    ucc5870->adcdata6.all     = 0U;
    ucc5870->adcdata7.all     = 0U;
    ucc5870->adcdata8.all     = 0U;
    ucc5870->crcdata.all      = 0U;
    ucc5870->spitest.all      = 0U;
    ucc5870->gd_address.all   = 0U;
    ucc5870->status1.all      = 0U;
    ucc5870->status2.all      = 0U;
    ucc5870->status3.all      = 0U;
    ucc5870->status4.all      = 0U;
    ucc5870->status5.all      = 0U;
    ucc5870->control1.all     = 0U;
    ucc5870->control2.all     = 0U;
    ucc5870->adccfg.all       = 0U;
    ucc5870->doutcfg.all      = 0U;
}

#endif
